{
  "video_id": "QQfaL3Jjdew",
  "source_url": "https://youtube.com/shorts/QQfaL3Jjdew?si=TGR95zS2FXUZYqn3",
  "transcript": "Based on searching for 'Falafel einfach selber machen😍😋 recipe', found these potential sources:\n1. https://emmikochteinfach.de/falafel-rezept-einfach-selber-machen/\n2. https://www.familienkost.de/rezept_falafel.html\n3. https://elavegan.com/de/falafel-rezept-vegan/\n\nThis appears to be a recipe video from youtube with title: Falafel einfach selber machen😍😋. Please extract the recipe based on typical recipes with this title.",
  "instructions": [
    "Sort and rinse the dried chickpeas, then soak them in water overnight.",
    "Drain the soaked chickpeas and let them dry for a few minutes.",
    "Peel the garlic cloves and onion, and chop them finely.",
    "Wash and drain the parsley and cilantro, then finely chop the herbs.",
    "In a large bowl, combine the chickpeas, garlic, onion, parsley, cilantro, cumin, coriander, and salt. Mix everything well.",
    "Add the baking powder to the chickpea mixture and mix until all the ingredients are evenly distributed.",
    "Shape the mixture into small balls or patties, pressing them firmly together.",
    "Preheat vegetable oil in a deep frying pan or a deep fryer to 180°C (350°F).",
    "Carefully place the falafel balls or patties into the hot oil and fry them in batches for 4-5 minutes or until golden brown and crispy.",
    "Remove the fried falafels from the oil and let them drain on paper towels.",
    "Serve the falafels hot with your favorite dipping sauce, in a pita bread, or as part of a mezze platter.\n\nEnjoy your homemade Falafels!\n\n_Note: The original sources (URLs) are provided at the beginning of the transcript. This recipe is a combination of elements from various recipes, aiming to reflect a typical \"Falafel einfach selber machen\" recipe._"
  ],
  "metadata": {
    "extraction_timestamp": 1745424006,
    "video_platform": "youtube",
    "source_type": "internet_search",
    "title": "Falafel einfach selber machen😍😋",
    "note": "Recipe extracted from internet search results, not directly from video content."
  }
}