{
  "video_id": "DkWYQgCTNkU",
  "source_url": "https://youtube.com/shorts/DkWYQgCTNkU?si=FVJn15nMZeFqDEkF",
  "transcript": "Liebst du Falafel genauso sehr wie wir? Dann solltest du unbedingt unsere knusprig frittierten Falafel probieren. Auf unserer Website oder in unserer kostenfreien App verraten wir dir, wie du das Gericht ganz einfach zu Hause zubereiten kannst. Viel Spaß dabei! Hier geht's zum Falafel-Rezept: https://www.kitchenstories.com/de/recipes/falafel\n\nMehr leckere Rezepte und hilfreiche Küchentipp-Videos findet ihr auf unserer Webseite: https://www.kitchenstories.com/\n\nLasst uns Freunde bleiben!\n\nFacebook: https://www.facebook.com/KitchenStoriesOfficial.de/\nInstagram: http://instagram.com/KitchenStories_official\nPinterest: https://www.pinterest.de/kitchenstories/\nTwitter: https://twitter.com/1KitchenStories\n\nLadet euch unsere kostenlose App runter!\niOS: https://itunes.apple.com/app/kitchen-stories-recipes-baking/id771068291\nAndroid: https://play.google.com/store/apps/details?id=com.ajnsnewmedia.kitchenstories",
  "instructions": [
    "Soak dried chickpeas in plenty of water overnight or for at least 8 hours.",
    "Drain and rinse the soaked chickpeas.",
    "In a food processor, combine chickpeas, onion, garlic, parsley, cilantro, coriander powder, cumin powder, salt, and black pepper. Pulse until a coarse mixture forms.",
    "Transfer the mixture to a bowl and stir in baking soda and 2 tablespoons of flour. If the mixture is too wet, add more flour, one tablespoon at a time, until the mixture can be formed into balls.",
    "Cover the bowl and refrigerate for 1 hour to help the mixture firm up.",
    "Shape the mixture into small balls or patties.",
    "In a deep frying pan, heat vegetable oil over medium heat until it reaches 350°F (175°C).",
    "Fry falafel balls or patties in batches for 3-5 minutes or until golden brown. Be careful not to overcrowd the pan.",
    "Remove falafel from the oil using a slotted spoon and place them on a plate lined with paper towels to drain excess oil.",
    "Serve falafel hot with your favorite toppings, such as tahini sauce, hummus, or tomatoes, lettuce, and onions.\n\nFor the most accurate recipe, follow the link provided in the transcript: https://www.kitchenstories.com/de/recipes/falafel.\n\nPlease note that I am an AI language model, and my suggestions may not always be 100% accurate or appropriate. Always double-check the recipes you are using, especially if you have allergies or dietary restrictions."
  ],
  "metadata": {
    "extraction_timestamp": 1745426156,
    "video_platform": "youtube",
    "source_type": "description",
    "title": "Das beste Rezept für authentische Falafel #shorts"
  }
}